In [2]:
#Required packages
import pandas as pd

In [68]:
#Loading the original climate dataset
df=pd.read_csv(r'C:\Users\jjojeda\Dropbox\GitHub\ClimateDataAutomation\sample_data\mega_data_frame_pre_met.csv')

In [69]:
df.isnull().sum(axis = 0)

lon               0
lat               0
year              0
days              0
radiation     13158
max_temp      13158
min_temp      13158
daily_rain    13158
dtype: int64

In [75]:
2*2*2*365

2920

In [70]:
#Rename variables
df=df.rename(columns={"days": "day","daily_rain": "rain",'min_temp':'mint','max_temp':'maxt','radiation':'radn'})

In [76]:
df0=df.loc[df['lon'] == 145.5]

In [77]:
df0=df0.loc[df['lat'] == -41.1]

In [78]:
df0=df0.loc[df['year'] == 2015]

In [79]:
df0=df0.loc[df['day'] == 1]
df0

         lon   lat  year  day  radn  maxt  mint  rain
0      145.5 -41.1  2015    1  20.2   NaN   NaN   NaN
730    145.5 -41.1  2015    1  20.6   NaN   NaN   NaN
4386   145.5 -41.1  2015    1   NaN  18.1   NaN   NaN
5116   145.5 -41.1  2015    1   NaN  19.4   NaN   NaN
8772   145.5 -41.1  2015    1   NaN   NaN   9.5   NaN
9502   145.5 -41.1  2015    1   NaN   NaN  10.4   NaN
13158  145.5 -41.1  2015    1   NaN   NaN   NaN   2.3
13888  145.5 -41.1  2015    1   NaN   NaN   NaN   1.6

In [80]:
df0.ffill().bfill().drop_duplicates()

         lon   lat  year  day  radn  maxt  mint  rain
0      145.5 -41.1  2015    1  20.2  18.1   9.5   2.3
730    145.5 -41.1  2015    1  20.6  18.1   9.5   2.3
5116   145.5 -41.1  2015    1  20.6  19.4   9.5   2.3
9502   145.5 -41.1  2015    1  20.6  19.4  10.4   2.3
13888  145.5 -41.1  2015    1  20.6  19.4  10.4   1.6

In [36]:
df1= df.copy()
df2= df.copy()

In [46]:
df_final = pd.merge(df, df1, on=['lon','lat','year','day'])

In [48]:
df_final = pd.merge(df_final, df2, on=['lon','lat','year','day'])

In [50]:
df_final.to_csv(r'C:\Users\jjojeda\Dropbox\GitHub\ClimateDataAutomation\sample_data\data.csv')